src/Catalogs/scmВнешниеСервисы_ПараметрыСоединения/scmВнешниеСервисы_ПараметрыСоединения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>scmВнешниеСервисы_ПараметрыСоединения</name>
  <predefined>
    <items>
      <name>bot_01</name>
      <description>Bot 01</description>
    </items>
  </predefined>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХостСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АктивныеЧаты</name>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Чат</name>
      <comment>Обрабатывать ответы чата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/scmОбщегоНазначенияВызовСервера/Module.bsl
&НаСервереБезКонтекста
// Функция - Конвертировать hex в dec
//
Функция КонвертироватьHexВDec(Знач ЧислоСтрокой) Экспорт
	
	Результат = 0;
	Шаблон = "0123456789ABCDEF";
	
	ЧислоСтрокой = ВРег(Строка(ЧислоСтрокой));
    Для ТекущийСимвол = 1 По СтрДлина(ЧислоСтрокой) Цикл
        ПозицияВШаблоне = Найти(Шаблон, Сред(ЧислоСтрокой, ТекущийСимвол, 1))-1;
        Результат = Результат * СтрДлина(Шаблон) + ПозицияВШаблоне;
    КонецЦикла;

    Возврат Результат;

КонецФункции

// Функция конвертирует hex в dec
//
Функция КонвертироватьHexВDec(Знач ЧислоСтрокой)
    
    Результат = 0;
    Шаблон = "0123456789ABCDEF";
    
    ЧислоСтрокой = ВРег(Строка(ЧислоСтрокой));
    Для ТекущийСимвол = 1 По СтрДлина(ЧислоСтрокой) Цикл
        ПозицияВШаблоне = Найти(Шаблон, Сред(ЧислоСтрокой, ТекущийСимвол, 1))-1;
        Результат = Результат * СтрДлина(Шаблон) + ПозицияВШаблоне;
    КонецЦикла;
    
    Возврат Результат;

КонецФункции

&НаСервере
// Функция загружает данные из макета в таблицу значений
//
Функция ЗагрузитьТаблицуИзМакета(ИмяМакета, ИмяОбласти) Экспорт
    
    Макет = ПолучитьОбщийМакет(ИмяМакета);
    ПостроительЗапроса = Новый ПостроительЗапроса;
    ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область(ИмяОбласти));
    ПостроительЗапроса.Выполнить();
        
    Возврат ПостроительЗапроса.Результат.Выгрузить();
    
КонецФункции

Функция scmВыполнитьОбработкуСообщенийЧатБотов() Экспорт 
	
	RespondBodyJSON = "";
	Если Константы.scmИспользоватьТелеграмБоты.Получить() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПП.Ссылка КАК Ссылка,
		               |	ПП.Наименование КАК ИмяСервиса,
		               |	ПП.АдресРесурса КАК АдресРесурса,
		               |	ПП.ХостСервера КАК ХостСервера,
		               |	ПП.ПортСервера КАК ПортСервера,
		               |	ПП.Пароль КАК Пароль,
		               |	ПП.ЗащищенноеСоединение КАК ЗащищенноеСоединение
		               |ИЗ
		               |	Справочник.scmВнешниеСервисы_ПараметрыСоединения КАК ПП
		               |ГДЕ
		               |	ПП.ЭтоБот = ИСТИНА
		               |	И ПП.Активно = ИСТИНА
		               |	И ПП.ПометкаУдаления = ЛОЖЬ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			RespondBodyJSON = Обработки.scmОбработкаТелеграмБот.Обработать_getUpdatesНаСервере(Выборка.Ссылка);		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат RespondBodyJSON;
	
КонецФункции
